In [1]:
import pandas as pd

In [12]:
df=pd.read_csv("sales_pro.csv")
df.head()

,sales_id,employee_id,customer_id,product_id,quantity,sales_date,transaction_id,week_start,month,year,total_price
0,11034,226,90412,357,3,2023-01-01 00:00:10,71df1ca8-bf62-4f5a-a596-4181451918ad,2022-12-26,1,2023,2.7
1,4487,63,66963,163,5,2023-01-01 00:00:12,a9ef5b45-e547-422c-b304-72b2a32ad2cf,2022-12-26,1,2023,101.5
2,7105,54,4612,241,2,2023-01-01 00:00:13,4a7ad5f9-da1d-4417-88cf-09252fab3612,2022-12-26,1,2023,54.4
3,5861,40,91195,441,10,2023-01-01 00:00:15,13db6d87-aea1-4048-8b07-522d9c2c1573,2022-12-26,1,2023,28.0
4,6705,227,60153,108,2,2023-01-01 00:00:18,228a0f8a-783b-486f-8f61-b5f78faf9ab2,2022-12-26,1,2023,45.2

In [19]:
df.tail()

,sales_id,employee_id,customer_id,product_id,quantity,sales_date,transaction_id,week_start,month,year,total_price
12013931,12012931,38,45667,359,2,2025-12-13 23:59:27,c46df962-da38-45d8-9584-6c3bda298f21,2025-12-08,12,2025,61.8
12013932,12006271,128,92685,438,1,2025-12-13 23:59:41,7e87391b-6cbf-49fb-82bb-4e3a680403a8,2025-12-08,12,2025,22.0
12013933,11998884,22,69964,72,6,2025-12-13 23:59:44,162bf6d9-96e6-4145-8a48-d90b594d129d,2025-12-08,12,2025,38.4
12013934,12004438,136,48346,375,4,2025-12-13 23:59:46,7b38a010-c021-472c-8388-294ebd5a2b65,2025-12-08,12,2025,8.4
12013935,12011347,107,84357,152,2,2025-12-13 23:59:48,6beb8a05-2f7f-4406-832f-c380d8ab624a,2025-12-08,12,2025,12.4

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12013936 entries, 0 to 12013935
Data columns (total 11 columns):
 #   Column          Dtype
---  ------          -----
 0   sales_id        int64
 1   employee_id     int64
 2   customer_id     int64
 3   product_id      int64
 4   quantity        int64
 5   sales_date      object
 6   transaction_id  object
 7   week_start      object
 8   month           int64
 9   year            int64
 10  total_price     float64
dtypes: float64(1), int64(7), object(3)
memory usage: 1008.2+ MB

In [4]:
df.isnull().sum()

sales_id          0
employee_id       0
customer_id       0
product_id        0
quantity          0
sales_date        0
transaction_id    0
week_start        0
month             0
year              0
total_price       0
dtype: int64

In [17]:
df.describe().apply(lambda s: s.apply('{:.2f}'.format))

,sales_id,employee_id,customer_id,product_id,quantity,month,year,total_price
count,12013936.00,12013936.00,12013936.00,12013936.00,12013936.00,12013936.00,12013936.00,12013936.00
mean,6006968.50,125.50,49367.83,229.88,3.28,6.44,2023.98,35.76
std,3468124.74,72.17,28514.43,128.22,2.30,3.40,0.81,22.78
min,1.00,1.00,1.00,1.00,1.00,1.00,2023.00,0.30
25%,3003484.75,63.00,24670.00,121.00,2.00,3.00,2023.00,18.80
50%,6006968.50,126.00,49368.00,234.00,3.00,6.00,2024.00,30.40
75%,9010452.25,188.00,74067.00,339.00,5.00,9.00,2025.00,50.20
max,12013936.00,250.00,98759.00,452.00,10.00,12.00,2025.00,107.50

In [15]:
df.shape

(12013936, 11)